refine desing
